saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/NXP.MKV44F16_DFP.11.0.0.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="cmp" Cversion="2.0.0" condition="device.MKV44F16_AND_driver.common">
      <description>CMP Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_cmp.c"/>
        <file category="header" name="drivers/fsl_cmp.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="clock" Cversion="2.1.0" condition="device.MKV44F16_AND_driver.common">
      <description>Clock Driver</description>
      <files>
        <file category="header" name="drivers/fsl_clock.h"/>
        <file category="sourceC" name="drivers/fsl_clock.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="aoi" Cversion="2.0.0" condition="device.MKV44F16_AND_driver.common">
      <description>AOI Driver</description>
      <files>
        <file category="header" name="drivers/fsl_aoi.h"/>
        <file category="sourceC" name="drivers/fsl_aoi.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="common" Cversion="2.0.1" condition="device.MKV44F16_AND_device.MKV44F16_CMSIS_AND_driver.clock">
      <description>COMMON Driver</description>
      <files>
        <file category="header" name="drivers/fsl_common.h"/>
        <file category="sourceC" name="drivers/fsl_common.c"/>
      </files>
    </component>
    <component Cclass="Board Support" Cgroup="SDK Project Template" Csub="project_template" Cvariant="MKV44F16" Cversion="1.0.0" condition="device.MKV44F16_AND_component.serial_manager_uart_AND_component.uart_adapter_AND_device.MKV44F16_startup_AND_driver.clock_AND_driver.common_AND_driver.gpio_AND_driver.port_AND_driver.smc_AND_driver.uart_AND_utility.debug_console" isDefaultVariant="1">
      <description/>
      <files>
        <file category="header" attr="config" name="project_template/board.h"/>
        <file category="sourceC" attr="config" name="project_template/board.c"/>
        <file category="header" attr="config" name="project_template/clock_config.h"/>
        <file category="sourceC" attr="config" name="project_template/clock_config.c"/>
        <file category="header" attr="config" name="project_template/pin_mux.h"/>
        <file category="sourceC" attr="config" name="project_template/pin_mux.c"/>
        <file category="header" attr="config" name="project_template/peripherals.h"/>
        <file category="sourceC" attr="config" name="project_template/peripherals.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Csub="MKV44F16_startup" Cversion="1.0.0" condition="device.MKV44F16_AND_CMSIS_Include_core_cm4">
      <description/>
      <files>
        <file condition="iar" category="sourceAsm" attr="config" name="iar/startup_MKV44F16.s"/>
        <file condition="mdk" category="sourceAsm" attr="config" name="arm/startup_MKV44F16.s"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/MKV44F128xxx16_flash.scf"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/MKV44F128xxx16_ram.scf"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/MKV44F256xxx16_flash.scf"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/MKV44F256xxx16_ram.scf"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/MKV44F64xxx16_flash.scf"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/MKV44F64xxx16_ram.scf"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/MKV44F128xxx16_flash.icf"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/MKV44F128xxx16_ram.icf"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/MKV44F256xxx16_flash.icf"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/MKV44F256xxx16_ram.icf"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/MKV44F64xxx16_flash.icf"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/MKV44F64xxx16_ram.icf"/>
        <file category="header" attr="config" name="fsl_device_registers.h"/>
        <file category="header" attr="config" name="MKV44F16.h"/>
        <file category="header" attr="config" name="MKV44F16_features.h"/>
        <file category="sourceC" attr="config" name="system_MKV44F16.c"/>
        <file category="header" attr="config" name="system_MKV44F16.h"/>
      </files>
    </component>
  </components>
</package>
